Revit 2027 API
DimensionSegmentArrayIterator Constructor
For Internal Use Only.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DimensionSegmentArrayIterator()
Public Sub New
public:
DimensionSegmentArrayIterator()
new : unit -> DimensionSegmentArrayIterator
Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.
See Also
Reference
DimensionSegmentArrayIterator Class
Autodesk.Revit.DB Namespace